src/DataProcessors/БонусныеПрограммы/БонусныеПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>БонусныеПрограммы</name>
</mdclass:DataProcessor>

src/Enums/СпособыПредоставленияСкидокНаценок/СпособыПредоставленияСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПредоставленияСкидокНаценок</name>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>Процент</name>
  </enumValues>
  <enumValues>
    <name>Округление</name>
  </enumValues>
  <enumValues>
    <name>КоличествоБонусныхБаллов</name>
  </enumValues>
  <enumValues>
    <name>ПроцентОтСуммыВВидеБонусныхБаллов</name>
  </enumValues>
  <enumValues>
    <name>ВидЦен</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>Подарок</name>
  </enumValues>
  <enumValues>
    <name>Промокод</name>
  </enumValues>
  <enumValues>
    <name>Расширение</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/АвтоматическиеСкидки/АвтоматическиеСкидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АвтоматическиеСкидки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БонуснаяПрограмма</name>
    <type>
      <types>CatalogRef.БонусныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПредоставления</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОграниченияПоНоменклатуре</name>
    <type>
      <types>EnumRef.ВариантыОграниченийСкидокПоНоменклатуре</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОкругления</name>
    <type>
      <types>EnumRef.ВариантыОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСовместногоПрименения</name>
    <type>
      <types>EnumRef.ВариантыСовместногоПримененияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьГруппыВУточненииПоНоменклатуре</name>
    <comment>(Опт)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОграниченияПоПолучателямКонтрагентам</name>
    <comment>По контрагентам (опт) или складам (розница).</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОграниченияПоПолучателямСкладам</name>
    <comment>(Розница)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУсловияПоДК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУточненияПоКатегориям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУточненияПоНоменклатуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУточненияПоЦеновымГруппам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСкидкиНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияАвтоматическихСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьПредоставления</name>
    <type>
      <types>EnumRef.ВариантыОбластейОграниченияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругления</name>
    <comment>Порядок округления</comment>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПредоставления</name>
    <type>
      <types>EnumRef.СпособыПредоставленияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПравилоНачисленияБонусов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОграниченияПоПолучателямСегментам</name>
    <comment>По контрагентам (опт) </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУточненияПоСегментамНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОграниченияПоПолучателям</name>
    <type>
      <types>EnumRef.ВариантыОграниченийСкидокПоКонтрагентам</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МоментВыдачиСообщения</name>
    <type>
      <types>EnumRef.ТочкиВыдачиСообщенияКассиру</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛюбойПодарокИзСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодарокИзКорзиныПокупателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПодарокКакПродажу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КратноКоличествуУсловий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратПодарка</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУсловияПредъявленПромокод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаНаСледующуюПокупкуПоПромокоду</name>
    <type>
      <types>CatalogRef.АвтоматическиеСкидки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУсловияАктивацииВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляРасчетаВРасширении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДаритьТолькоПолныйКомплект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВремяПоДнямНедели</name>
    <comment>Время действия скидки</comment>
    <attributes>
      <name>Выбран</name>
      <comment>(Общ) Признак выбранного дня недели</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <comment>(Общ) День недели</comment>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <comment>(Общ) Время начала действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <comment>(Общ) Время окончания действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НоменклатураГруппыЦеновыеГруппы</name>
    <attributes>
      <name>ЗначениеУточнения</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.КатегорииНоменклатуры</types>
        <types>CatalogRef.ЦеновыеГруппы</types>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УсловияПредоставления</name>
    <attributes>
      <name>УсловиеПредоставления</name>
      <type>
        <types>CatalogRef.УсловияПредоставленияСкидокНаценок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкидкиКонтрагенты</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкидкиСклады</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкидкиСегменты</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.СегментыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборПодарков</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/БонусныеПрограммы/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

// Процедура - обработчик команды УстановитьФлагДействует формы.
//
&НаКлиенте
Процедура УстановитьФлагДействует(Команда)
	
	Если ЗначениеЗаполнено(Элементы.ПравилаНачисленияБонусов.ВыделенныеСтроки) Тогда
		ИзменитьФлагДействуетСервер(Истина, Элементы.ПравилаНачисленияБонусов.ВыделенныеСтроки);
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик команды СброситьФлагДействует формы.
//
&НаКлиенте
Процедура СброситьФлагДействует(Команда)
	
	Если ЗначениеЗаполнено(Элементы.ПравилаНачисленияБонусов.ВыделенныеСтроки) Тогда
		ИзменитьФлагДействуетСервер(Ложь, Элементы.ПравилаНачисленияБонусов.ВыделенныеСтроки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// В процедуре можно установить или сбросить флаг "Действует".
//
// Параметры:
//  НовоеЗначение  - Булево - Новое значение флага "Действует".
//  МассивВыделенныхСтрок  - Массив - Массив строк, которые выделены в списке автоматических скидок.
//
&НаСервере
Процедура ИзменитьФлагДействуетСервер(НовоеЗначение, Знач МассивВыделенныхСтрок)

	НужноОбновлятьСписок = Ложь;
	Для Каждого СтрокаАвтоСкидок Из МассивВыделенныхСтрок Цикл
		Если СтрокаАвтоСкидок.Действует <> НовоеЗначение Тогда
			Если СтрокаАвтоСкидок.Ссылка.Пустая() Или СтрокаАвтоСкидок.ЭтоГруппа Тогда
				Продолжить;
			КонецЕсли;
			ОбъектАвтоСкидка = СтрокаАвтоСкидок.Ссылка.ПолучитьОбъект();
			ОбъектАвтоСкидка.Действует = НовоеЗначение;
			Попытка
				ОбъектАвтоСкидка.Записать();
				НужноОбновлятьСписок = Истина;
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон(НСтр(
					"ru = 'Не удалось изменить флажок ""Действует"" для автоматической скидки, наценки ""%1"".'"),
					СтрокаАвтоСкидок.Ссылка);
				Сообщение.Поле = "Действует";
				Сообщение.УстановитьДанные(СтрокаАвтоСкидок.Ссылка);
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Если НужноОбновлятьСписок Тогда
		Элементы.ПравилаНачисленияБонусов.Обновить();
	КонецЕсли;

КонецПроцедуры // ИзменитьФлагДействуетСервер()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормы

&НаКлиенте
Процедура ПравилаНачисленияБонусовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ЭтоПравилоНачисленияБонусов", Истина);
	СтруктураРеквизитов.Вставить("СпособПредоставления", ПредопределенноеЗначение("Перечисление.СпособыПредоставленияСкидокНаценок.ПроцентОтСуммыВВидеБонусныхБаллов"));
	
	ОткрытьФорму("Справочник.АвтоматическиеСкидки.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураРеквизитов));
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаНачисленияБонусовПриИзменении(Элемент)
	
	Элемент.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппуПравилНачисления(Команда)
	
	ПараметрыДляФормыГруппы = Новый Структура("ЭтоГруппа, ЭтоПравилоНачисленияБонусов", Истина, Истина);
	ОткрытьФорму("Справочник.АвтоматическиеСкидки.ФормаГруппы", ПараметрыДляФормыГруппы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ВариантСовместногоПримененияСкидок.
//
&НаКлиенте
Процедура ВариантСовместногоПримененияБонусовПриИзменении(Элемент)
	
	ВариантСовместногоПримененияБонусовПриИзмененииНаСервере(ВариантСовместногоПримененияБонусов);
	Если ВариантСовместногоПримененияБонусов = ПредопределенноеЗначение("Перечисление.ВариантыСовместногоПримененияСкидокНаценок.Вытеснение")
		ИЛИ ВариантСовместногоПримененияБонусов = ПредопределенноеЗначение("Перечисление.ВариантыСовместногоПримененияСкидокНаценок.Умножение") Тогда
		ПроверитьСортировкуСписка();
	КонецЕсли;
	Элементы.ПравилаНачисленияБонусов.Обновить();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ВариантСовместногоПримененияСкидок (серверная часть).
//
&НаСервереБезКонтекста
Процедура ВариантСовместногоПримененияБонусовПриИзмененииНаСервере(ВариантСовместногоПримененияСкидок)
	
	Константы.ВариантыСовместногоПримененияНачисленийБонусов.Установить(ВариантСовместногоПримененияСкидок);
	
КонецПроцедуры

#КонецОбласти

#Область СортировкаСписка

// Процедура проверяет установленную сортировку по реквизиту "РеквизитДопУпорядочивания" и предлагает
// установить такую сортировку.
//
&НаКлиенте
Процедура ПроверитьСортировкуСписка()
	
	ПараметрыУстановкиСортировки = Новый Структура;
	ПараметрыУстановкиСортировки.Вставить("СписокРеквизит", ПравилаНачисленияБонусов);
	ПараметрыУстановкиСортировки.Вставить("СписокЭлемент", Элементы.ПравилаНачисленияБонусов);
	
	Если Не СортировкаВСпискеУстановленаПравильно(ПравилаНачисленияБонусов) Тогда
		ТекстВопроса = НСтр("ru = 'Сортировку списка рекомендуется установить
								|по полю ""Порядок"". Настроить необходимую сортировку?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьСписокПередОперациейОтветПоСортировкеПолучен", ЭтотОбъект, ПараметрыУстановкиСортировки);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Настроить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Не настраивать'"));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Функция проверяет, что в списке установлена сортировка по реквизиту РеквизитДопУпорядочивания.
//
&НаКлиенте
Функция СортировкаВСпискеУстановленаПравильно(Список)
	
	ПользовательскиеНастройкиПорядка = Неопределено;
	Для Каждого Элемент Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПорядокКомпоновкиДанных") Тогда
			ПользовательскиеНастройкиПорядка = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПользовательскиеНастройкиПорядка = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЭлементыПорядка = ПользовательскиеНастройкиПорядка.Элементы;
	
	// Найдем первый используемый элемент порядка
	Элемент = Неопределено;
	Для Каждого ЭлементПорядка Из ЭлементыПорядка Цикл
		Если ЭлементПорядка.Использование Тогда
			Элемент = ЭлементПорядка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Элемент = Неопределено Тогда
		// Не установлена никакая сортировка
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Элемент) = Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
		Если Элемент.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр Тогда
			ПолеРеквизита = Новый ПолеКомпоновкиДанных("РеквизитДопУпорядочивания");
			Если Элемент.Поле = ПолеРеквизита Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Процедура обрабатывает ответ пользователя на вопрос об установке сортировки по реквизиту РеквизитДопУпорядочивания.
//
&НаКлиенте
Процедура ПроверитьСписокПередОперациейОтветПоСортировкеПолучен(РезультатОтвета, ДополнительныеПараметры) Экспорт
	
	Если РезультатОтвета <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСортировкуСпискаПоПолюПорядок();
	
КонецПроцедуры

// Процедура устанавливает сортировку по полю РеквизитДопУпорядочивания.
//
&НаКлиенте
Процедура УстановитьСортировкуСпискаПоПолюПорядок()
	
	СписокРеквизит = ПравилаНачисленияБонусов;
	
	ПользовательскиеНастройкиПорядка = Неопределено;
	Для Каждого Элемент Из СписокРеквизит.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПорядокКомпоновкиДанных") Тогда
			ПользовательскиеНастройкиПорядка = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.Проверить(ПользовательскиеНастройкиПорядка <> Неопределено, НСтр("ru = 'Пользовательская настройка порядка не найдена.'"));
	
	ПользовательскиеНастройкиПорядка.Элементы.Очистить();
	Элемент = ПользовательскиеНастройкиПорядка.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	Элемент.Использование = Истина;
	Элемент.Поле = Новый ПолеКомпоновкиДанных("РеквизитДопУпорядочивания");
	Элемент.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВариантСовместногоПримененияБонусов = Константы.ВариантыСовместногоПримененияНачисленийБонусов.Получить();
	Если ВариантСовместногоПримененияБонусов.Пустая() Тогда
		ВариантСовместногоПримененияБонусов = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Максимум;
		Константы.ВариантыСовместногоПримененияСкидокНаценок.Установить(ВариантСовместногоПримененияБонусов);
	КонецЕсли;
	
	// Открытие из вида дисконтных карт для настройки бонусов по ДК
	Если Параметры.Свойство("ДисконтныеКарты") И Параметры.ДисконтныеКарты Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПравилаНачисления;
		Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаБонусныеПрограммы.Видимость = Ложь;
		Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаНачисленияИСписания.Видимость = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПравилаНачисленияБонусов,
			"ЕстьУсловияПоДК", Истина,,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
		Если Параметры.Свойство("БонуснаяПрограмма") И ЗначениеЗаполнено(Параметры.БонуснаяПрограмма) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПравилаНачисленияБонусов,
				"БонуснаяПрограмма", Параметры.БонуснаяПрограмма,,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
